cf/Catalogs/Counterparties.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Counterparties</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccountByDefault</Name>
					<Comment>Bank account by default</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoOperationsByContracts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoOperationsByDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoOperationsByOrders</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrackPaymentsByBills</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntityIndividual</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartyKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartiesAccessGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractByDefault</Name>
					<Comment>Default counterparty contract</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContactPerson</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContactPersons</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasicInformation</Name>
					<Comment>It used to search in the list</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerAdvancesGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLAccountCustomerSettlements</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLAccountVendorSettlements</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VendorAdvancesGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Managerial</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationCountry</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.WorldCountries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerAcquisitionChannel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CustomerAcquisitionChannels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Supplier</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OtherRelationship</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateOfBirth</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Gender</Name>
					<Type>
						<v8:Type>cfg:EnumRef.IndividualGender</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FinancialCounterpartyGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Region</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Tags</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Tag</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Tags</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ActivityTypes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ActivityType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ActivityTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/CounterpartyDuplicatesExist.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>CounterpartyDuplicatesExist</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Counterparty</Name>
					<Comment>Counterparty to whom there are duplicates</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/AccumulationRegisters/AccountsReceivable.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>AccountsReceivable</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountCur</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SettlementsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SettlementsTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.FixedAssetsTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
						<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.Netting</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/CounterpartyKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>CounterpartyKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>LegalEntity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Individual</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Counterparties/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") And Not IsFolder Then
		
		FillPropertyValues(ThisObject, FillingData);
		
	EndIf;
	
	FillByDefault();
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	NoncheckableAttributeArray = New Array;
	
	If Not Catalogs.CounterpartiesAccessGroups.AccessGroupsAreUsed() Then
		NoncheckableAttributeArray.Add("AccessGroup");
	EndIf;
	
	CommonUse.DeleteUnverifiableAttributesFromArray(CheckedAttributes, NoncheckableAttributeArray);
	
EndProcedure

Procedure BeforeWrite(Cancel)
	
	// 1. Actions which are always executed, including the exchange of data
	
	AdditionalProperties.Insert("NeedToWriteInRegisterOnWrite", False);
	
	// No execute action in the data exchange
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not IsNew() Then
		CheckChangePossibility(Cancel);
	EndIf;
	
	If Cancel Then
		Return;
	EndIf;
	
	If Not (AdditionalProperties.Property("RegisterCounterpartyDuplicates") And AdditionalProperties.RegisterCounterpartyDuplicates = False) Then
		RegisterCounterpartyDuplicates();
	EndIf;
		
	If Not IsFolder AND IsNew() Then
		CreationDate = CurrentDate();
	EndIf;
	If Not IsFolder Then
		GenerateBasicInformation();
	EndIf;
	

	RefTreaty = Undefined;
	
	// Fill default contract: substitute any existing or create a new
	If Not IsFolder AND Not ValueIsFilled(ContractByDefault) Then
		
		NeedCreateContract	= True;
		
		If Not IsNew() Then
			
			Query = New Query;
			Query.Text = 
				"SELECT TOP 1
				|	CounterpartyContracts.Ref AS Contract
				|FROM
				|	Catalog.CounterpartyContracts AS CounterpartyContracts
				|WHERE
				|	CounterpartyContracts.Owner = &Owner
				|	AND CounterpartyContracts.DeletionMark = FALSE
				|
				|ORDER BY
				|	CounterpartyContracts.ContractNo DESC";
			
			Query.SetParameter("Owner", Ref);
			
			QueryResult = Query.Execute();
			
			If Not QueryResult.IsEmpty() Then
				
				Selection = QueryResult.Select();
				Selection.Next();
				ContractByDefault = Selection.Contract;
				
				NeedCreateContract = False;
				
			EndIf;
			
		EndIf;
		
		If NeedCreateContract Then
			ContractByDefault = Catalogs.CounterpartyContracts.GetRef();
			AdditionalProperties.Insert("NewMainContract", ContractByDefault);
		EndIf;
		
	EndIf;
	
	BringDataToConsistentState();
	
EndProcedure // BeforeWrite()

Procedure OnWrite(Cancel)
	
	If AdditionalProperties.NeedToWriteInRegisterOnWrite Then
		Catalogs.Counterparties.ExecuteRegisterRecordsOnRegisterTakes(Ref, TIN, False);
	EndIf;
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	// Create a counterparty contract by reference created in the event BeforeWrite()
	If Not IsFolder And AdditionalProperties.Property("NewMainContract") Then
		
		ContractObject = Catalogs.CounterpartyContracts.CreateItem();
		ContractObject.Fill(Ref);
		
		ContractObject.SetNewObjectRef(AdditionalProperties.NewMainContract);
		ContractObject.Write();
		
		AdditionalProperties.Delete("NewMainContract");
		
	EndIf;
	
EndProcedure // OnWrite()

Procedure OnCopy(CopiedObject)
	
	If Not IsFolder Then
		BankAccountByDefault	= Undefined;
		ContractByDefault		= Undefined;
		ContactPerson			= Undefined;
	EndIf;
	
EndProcedure

Procedure BeforeDelete(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	DeleteDuplicateRegistrationBeforeDelete();
	
EndProcedure

#EndRegion

#Region Interface

// Procedure fills an auxiliary attribute "BasicInformation"
//
Procedure GenerateBasicInformation() Export
	
	RowsArray = New Array;
	
	If Not IsBlankString(DescriptionFull) Then
		RowsArray.Add(DescriptionFull);
	EndIf;
	
	If Not IsBlankString(TIN) Then
		RowsArray.Add(NStr("ru='ИНН'; en = 'TIN'") + " " + TIN);
	EndIf;
	
	CI = ContactInformation.Unload();
	CI.Sort("Kind");
	For Each RowCI In CI Do
		If IsBlankString(RowCI.Presentation) Then
			Continue;
		EndIf;
		RowsArray.Add(RowCI.Presentation);
	EndDo;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	ContactPersons.Description AS Description,
	|	ContactPersons.ContactInformation.(
	|		Presentation AS Presentation,
	|		Kind AS KindCI
	|	)
	|FROM
	|	Catalog.ContactPersons AS ContactPersons
	|WHERE
	|	ContactPersons.Owner = &Counterparty
	|	AND ContactPersons.DeletionMark = FALSE
	|
	|ORDER BY
	|	Description,
	|	KindCI";
	
	Query.SetParameter("Counterparty", Ref);
	
	SelectionCP = Query.Execute().Select();
	While SelectionCP.Next() Do
		
		If RowsArray.Count() > 0 Then
			RowsArray.Add(Chars.LF);
		EndIf;
		RowsArray.Add(SelectionCP.Description);
		
		SelectionCI = SelectionCP.ContactInformation.Select();
		While SelectionCI.Next() Do
			If IsBlankString(SelectionCI.Presentation) Then
				Continue;
			EndIf;
			RowsArray.Add(SelectionCI.Presentation);
		EndDo;
		
	EndDo;
	
	If Not IsBlankString(Comment) Then
		RowsArray.Add(Comment);
	EndIf;
	
	If ValueIsFilled(Responsible) Then
		RowsArray.Add(CommonUse.ObjectAttributeValue(Responsible, "Description"));
	EndIf;
	
	BasicInformation = StrConcat(RowsArray, Chars.LF);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

Procedure FillByDefault()
	
	If IsFolder Then
		Return;
	EndIf;
	
	If Not ValueIsFilled(Responsible) Then
		Responsible = SmallBusinessReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainResponsible");
	EndIf;
	
EndProcedure

// Procedure checks the TIN correctness and fixes the counterparty duplicate existence
//
Procedure RegisterCounterpartyDuplicates()
	
	If IsFolder Then
		Return;
	EndIf;
	
	NeedToCheck = IsNew();
	
	IsLegalEntity = LegalEntityIndividual = Enums.CounterpartyKinds.LegalEntity;
	
	TINModified = NeedToCheck;
	
	If Not NeedToCheck Then
		
		PreviousValueStructure = CommonUse.ObjectAttributesValues(Ref, 
																  "TIN,
																  |LegalEntityIndividual");
																			  
		If Not PreviousValueStructure.TIN = TIN 
			Or Not PreviousValueStructure.LegalEntityIndividual = LegalEntityIndividual Then
			
			NeedToCheck = True; 
			
		EndIf;
		
		TINModified = Not PreviousValueStructure.TIN = TIN;
		
		WasLegalEntity = PreviousValueStructure.LegalEntityIndividual = Enums.CounterpartyKinds.LegalEntity;
		
		If NeedToCheck Then
			
			If Not PreviousValueStructure.TIN = TIN Then
			
				Block = New DataLock;
				
				If Not PreviousValueStructure.TIN = TIN Then
			
					LockItemStillTIN = Block.Add("InformationRegister.CounterpartyDuplicatesExist");
					LockItemStillTIN.SetValue("TIN", PreviousValueStructure.TIN);
					LockItemStillTIN.Mode = DataLockMode.Exclusive;
					
				EndIf;
				
				Block.Lock();
				
			EndIf;
			
			PreviousDuplicateArray = Catalogs.Counterparties.HasRecordsInDuplicatesRegister(TrimAll(PreviousValueStructure.TIN), Ref);
		Else
			PreviousDuplicateArray = New Array;
		EndIf;
		
	Else
		
		PreviousDuplicateArray = New Array;
		
	EndIf;
	
	If NeedToCheck Then
		
		If TINModified Then
			
			Block = New DataLock;
			LockItemByTIN = Block.Add("InformationRegister.CounterpartyDuplicatesExist");
			LockItemByTIN.SetValue("TIN", TIN);
			LockItemByTIN.Mode = DataLockMode.Exclusive;
			
			Block.Lock();
			
			DuplicateArray = Catalogs.Counterparties.CheckCatalogDuplicatesCounterpartiesByTIN(TrimAll(TIN), Ref, True);
																								
			If DuplicateArray.Count() > 0 Then
				
				// For new item reference will be available only OnWrite, there also we will write.
				AdditionalProperties.NeedToWriteInRegisterOnWrite = True;
				
				For Each ArrayElement IN DuplicateArray Do
					Catalogs.Counterparties.ExecuteRegisterRecordsOnRegisterTakes(ArrayElement, TIN, False);
				EndDo;
				
			EndIf;
			
			If PreviousDuplicateArray.Count() > 0 Then
				
				Catalogs.Counterparties.ExecuteRegisterRecordsOnRegisterTakes(Ref, PreviousValueStructure.TIN, True);
				
				If PreviousDuplicateArray.Count() = 1 Then
					Catalogs.Counterparties.ExecuteRegisterRecordsOnRegisterTakes(PreviousDuplicateArray[0], PreviousValueStructure.TIN, True);
				EndIf;
				
			EndIf;
			
		Else
			
			If PreviousDuplicateArray.Count() > 0 Then
				
				Catalogs.Counterparties.ExecuteRegisterRecordsOnRegisterTakes(Ref, PreviousValueStructure.TIN, True);
			
				If PreviousDuplicateArray.Count() = 1 Then
					Catalogs.Counterparties.ExecuteRegisterRecordsOnRegisterTakes(PreviousDuplicateArray[0], PreviousValueStructure.TIN, True);
				EndIf;
				
			EndIf;
			
		EndIf;
		
	EndIf;
	
EndProcedure

// Procedure clears the register CounterpartyDuplicateExist
//
Procedure DeleteDuplicateRegistrationBeforeDelete()
	
	DuplicateArray = Catalogs.Counterparties.HasRecordsInDuplicatesRegister(TrimAll(TIN), Ref);
	
	If DuplicateArray.Count() = 1 Then
		
		Block = New DataLock;
		LockItemStillTIN = Block.Add("InformationRegister.CounterpartyDuplicatesExist");
		LockItemStillTIN.SetValue("TIN", TIN);
		LockItemStillTIN.Mode = DataLockMode.Exclusive;
		
		Block.Lock();
		
		Catalogs.Counterparties.ExecuteRegisterRecordsOnRegisterTakes(DuplicateArray[0], TIN, True);
		
	EndIf;
	
EndProcedure

// The procedure checks the consistency of the data in IB
//
// Parameters:
//  Cancel	 - 	Boolean - Establish True in the case of inconsistent data
//
Procedure CheckChangePossibility(Cancel)
	
	// Barring changes in analysts account for mutual counterparty if movements on registers settlements.
	
	PreviousValues = CommonUse.ObjectAttributesValues(Ref,
		"DoOperationsByContracts,DoOperationsByDocuments,DoOperationsByOrders");
		
	If DoOperationsByContracts <> PreviousValues.DoOperationsByContracts
		Or DoOperationsByDocuments <> PreviousValues.DoOperationsByDocuments
		Or DoOperationsByOrders <> PreviousValues.DoOperationsByOrders Then
		
		Query = New Query;
		Query.Text = 
		"SELECT TOP 1
		|	AccountsReceivable.Counterparty
		|FROM
		|	AccumulationRegister.AccountsReceivable AS AccountsReceivable
		|WHERE
		|	AccountsReceivable.Counterparty = &Counterparty
		|
		|UNION ALL
		|
		|SELECT TOP 1
		|	AccountsPayable.Counterparty
		|FROM
		|	AccumulationRegister.AccountsPayable AS AccountsPayable
		|WHERE
		|	AccountsPayable.Counterparty = &Counterparty";
		
		Query.SetParameter("Counterparty", Ref);
		
		SetPrivilegedMode(True);
		QueryResult = Query.Execute();
		SetPrivilegedMode(False);
		
		If Not QueryResult.IsEmpty() Then
			MessageText = NStr("en='Records are registered for mutual settlements with the counterparty in the infobase. Cannot change the settlements accounting dimension.';ru='В базе присутствуют движения по взаиморасчетам с контрагентом. Изменение аналитики учета взаиморасчетов запрещено.'");
			SmallBusinessServer.ShowMessageAboutError(ThisObject, MessageText,,,, Cancel);
		EndIf;
		
	EndIf;
	
EndProcedure

// Procedure coordinates the state some attributes of the object depending on the other
//
Procedure BringDataToConsistentState()
	
	If LegalEntityIndividual = Enums.CounterpartyKinds.Individual Then
		
		LegalForm = Catalogs.LegalForms.EmptyRef();
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
